---
kind: method
id: M:Autodesk.Revit.DB.TemporaryViewModes.DeactivateAllModes
source: html/d3ca63c1-b150-c1cd-2610-7083bd1b8263.htm
---
# Autodesk.Revit.DB.TemporaryViewModes.DeactivateAllModes Method

Deactivates all temporary modes that are currently active.

## Syntax (C#)
```csharp
public void DeactivateAllModes()
```